## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.ec2_instance.aws_instance.this[0] has changed
  ~ resource "aws_instance" "this" {
        id                                   = "i-0b0e92b916551e5a5"
        tags                                 = {
            "Environment" = "Prod"
            "Name"        = "Stagnum-stack"
            "Project"     = "Stagnum"
            "Service"     = "Stagnum"
            "Terraform"   = "true"
        }
        # (35 unchanged attributes hidden)

      + ebs_block_device {
          + delete_on_termination = false
          + device_name           = "/dev/sdd"
          + encrypted             = false
          + iops                  = 3000
          + tags                  = {}
          + tags_all              = {}
          + throughput            = 125
          + volume_id             = "vol-0e43128d7861fd8db"
          + volume_size           = 10
          + volume_type           = "gp3"
        }

        # (9 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_route53_record.back will be updated in-place
  ~ resource "aws_route53_record" "back" {
        id                               = "Z0480732KREV4NLN9I3F_back.stagnum.net_A"
        name                             = "back.stagnum.net"
      ~ records                          = [
          - "16.170.163.210",
        ] -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_route53_record.main will be updated in-place
  ~ resource "aws_route53_record" "main" {
        id                               = "Z0480732KREV4NLN9I3F_stagnum.net_A"
        name                             = "stagnum.net"
      ~ records                          = [
          - "16.170.163.210",
        ] -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_route53_record.www will be updated in-place
  ~ resource "aws_route53_record" "www" {
        id                               = "Z0480732KREV4NLN9I3F_www.stagnum.net_A"
        name                             = "www.stagnum.net"
      ~ records                          = [
          - "16.170.163.210",
        ] -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_volume_attachment.this must be replaced
-/+ resource "aws_volume_attachment" "this" {
      ~ id          = "vai-4046788145" -> (known after apply)
      ~ instance_id = "i-0b0e92b916551e5a5" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.ec2_instance.aws_instance.this[0] must be replaced
-/+ resource "aws_instance" "this" {
      ~ ami                                  = "ami-0b15dce563b217be3" -> "ami-07c8c1b18ca66bb07" # forces replacement
      ~ arn                                  = "arn:aws:ec2:eu-north-1:851725292587:instance/i-0b0e92b916551e5a5" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 2 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      ~ id                                   = "i-0b0e92b916551e5a5" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-083250764d01758f3" -> (known after apply)
      ~ private_dns                          = "ip-10-0-1-28.eu-north-1.compute.internal" -> (known after apply)
      ~ private_ip                           = "10.0.1.28" -> (known after apply)
      ~ public_dns                           = "ec2-16-170-163-210.eu-north-1.compute.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "16.170.163.210" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      + spot_instance_request_id             = (known after apply)
        tags                                 = {
            "Environment" = "Prod"
            "Name"        = "Stagnum-stack"
            "Project"     = "Stagnum"
            "Service"     = "Stagnum"
            "Terraform"   = "true"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data_base64                     = (known after apply)
      ~ volume_tags                          = {
          - "Environment" = "Prod" -> null
          ~ "Name"        = "Stagnum-postgers" -> "Stagnum-stack"
          - "Project"     = "Stagnum" -> null
          - "Service"     = "Stagnum" -> null
          - "Terraform"   = "true" -> null
        }
        # (13 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 2 -> null
        }

      ~ credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      - ebs_block_device {
          - delete_on_termination = false -> null
          - device_name           = "/dev/sdd" -> null
          - encrypted             = false -> null
          - iops                  = 3000 -> null
          - tags                  = {} -> null
          - tags_all              = {} -> null
          - throughput            = 125 -> null
          - volume_id             = "vol-0e43128d7861fd8db" -> null
          - volume_size           = 10 -> null
          - volume_type           = "gp3" -> null
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      ~ metadata_options {
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
            # (4 unchanged attributes hidden)
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/sda1" -> null
          - encrypted             = false -> null
          - iops                  = 3000 -> null
          - tags                  = {} -> null
          - tags_all              = {} -> null
          - throughput            = 125 -> null
          - volume_id             = "vol-040d6a727a3027eaa" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp3" -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 3 to change, 2 to destroy.

Changes to Outputs:
  ~ ec2_eip         = "16.170.163.210" -> (known after apply)
  ~ ec2_public_dns  = "ec2-16-170-163-210.eu-north-1.compute.amazonaws.com" -> (known after apply)
```
</details>